## Series

In [1]:
import pandas as pd  
import numpy as np

In [2]:
heros = pd.Series([100, 200, 300], index=["Такеда", "Хонда", "Ода"])
heros # Позволяет из списка сделать таблицу состоящую из 1 столбца.

Такеда    100
Хонда     200
Ода       300
dtype: int64

## DataFrame

In [3]:
information = {"Имя": ["Алиса", "Боб", "Катя"],
           "Возраст": [25, 30, 22],
             "Город": ["Киото", "Эдо", "Осака"]
}
df = pd.DataFrame(information, index=[i for i in range(1, 4)]) 
index=[i for i in range(1, 4)] # задает индексы строк с 1 по 3. 
# Позволяет из словаря сделать таблицу состоящую из нескольких столбцов.
df

     Имя  Возраст  Город
1  Алиса       25  Киото
2    Боб       30    Эдо
3   Катя       22  Осака

In [4]:
df.head(10) # Показывает первые 10 строк таблицы.

     Имя  Возраст  Город
1  Алиса       25  Киото
2    Боб       30    Эдо
3   Катя       22  Осака

In [5]:
df.tail(3) # Показывает последние 3 строки таблицы.

     Имя  Возраст  Город
1  Алиса       25  Киото
2    Боб       30    Эдо
3   Катя       22  Осака

In [6]:
df.shape # Показывает размер таблицы (строки, столбцы).

(3, 3)

In [7]:
df.info() 
# Показывает информацию о таблице: количество строк, столбцов, типы данных.

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, 1 to 3
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Имя      3 non-null      object
 1   Возраст  3 non-null      int64
 2   Город    3 non-null      object
dtypes: int64(1), object(2)
memory usage: 96.0+ bytes

In [8]:
df.describe() # Показывает статистические данные по числовым столбцам таблицы.

         Возраст
count   3.000000
mean   25.666667
std     4.041452
min    22.000000
25%    23.500000
50%    25.000000
75%    27.500000
max    30.000000

In [9]:
info = {'Имя' : ['Александр', 'Василий'],   
  'Возраст' : [22, 19],
    'Город' : ['Киото', 'Эдо'], 
    'Способность' : ['Сила', 'Ум']
     }
df = pd.DataFrame(info, index =[i for i in range(1, 3)])
df

         Имя  Возраст  Город Способность
1  Александр       22  Киото        Сила
2    Василий       19    Эдо          Ум

In [10]:
data = {'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
        'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
        'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df = pd.DataFrame(data, index=labels) 
df
# Создает таблицу из словаря с заданными индексами строк.

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

In [11]:
data = {'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
        'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
        'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df = pd.DataFrame(data, index=labels)

print(f"Размерность таблицы: {df.shape[0]} строк, {df.shape[1]} столбцов")
# Выводит размер таблицы в формате: количество строк, количество столбцов

Размерность таблицы: 10 строк, 4 столбцов